Repository: horizon-institute/Timestreams
Catalog: Timestreams-*.po
Languages: pt_br

source: Timestreams Options
pt_br: Opções de Timestreams

source: Please enter the following values if you are replicating your data through a proxy server.
pt_br: Por favor entre com os seguinte valores se você está replicando seus dados através de um servidor proxy.

source: Proxy Address
pt_br: Endereço do proxy

source: Proxy Port
pt_br: Porta do Proxy

source: Save Changes
pt_br: Salvar

source: Data Sources
pt_br: Fontes de Dados

source: Visualisations
pt_br: Visualizações

source: Context
pt_br: Contexto

source: Replication
pt_br: Replicação

source: Description
pt_br: Descrição

source: Data sources describe the sensor data brought into Timestreams. A device such as a weateher station may collect data using multiple sensors (thermometer, barometer, etc.). Please use one datasource entry per type of sensor.
pt_br: As fontes de dados descrevem os dados dos sensores que são trazidos para o Timestream.

source: To add a new data source fill in the form below so that the platform knows what type of data you are adding into the system. Please note that the values for the unit of measurement field should be entered in <a href="http://en.wikipedia.org/wiki/Internet_media_type" title="Wikipedia entry on Internet media types">internet media type</a> format. For sensor data follow a protocol of: text/x-data-Unit, where Unit would be the unit of measurement (such as Celsius or Decibels). For example: text/x-data-celsius or image/png. Data Types are used to store your data in the correct format. For instance, if you are storing image files you'd want to use a textual type (VARCHR(255)), but if you're storing temperature readings between 0 and 100 then you'd want to use a numeric type (DECIMAL(4,1)). You may use any of the standard <a href="https://dev.mysql.com/doc/refman/5.5/en/data-types.html" title="mysql data types">MySQL ones</a>.
pt_br: Para adicionar uma nova fonte de dados preencha o formulário abaixo, de forma que a plataforma saiba que tipo de daods você está adicionando ao sistema. Por favor observe que valores para o campo “unidade de medida” devem ser colocados no formato <a href="http://en.wikipedia.org/wiki/Internet_media_type" title="Wikipedia entry on Internet media types">Tipo de mídia da internet</a>. Para sensores de dados siga o protocolo: text/x-dado-Unidade, where Unidade será a unidade de medida(como Celsius ou Decibéis). Por exemplo: text/x-dado-celsius or image/png. Tipos de dados são utilizados para armazenar seus dados no formato correto. Por exemplo, se você estiver guardando arquivos de imagens, você deverá usuar um tipo textual (VARCHR(255)). Porém, se você estiver guardando leituras de temperatura entre 0 e 100 então você deverá usar o tipo numérico (DECIMAL(4,1)). Você poderá usar qualquer um dos padrões de <a href="https://dev.mysql.com/doc/refman/5.5/en/data-types.html" title="mysql data types"> MySQL </a>.

source: Timestreams - Context
pt_br: Timestreams - Contexto

source: Context records let you describe the context of the data you collect. These can be any type such as location, activity or session id.
pt_br: Os registros de contexto deixam você descrever o contexto no qual os seus dados são coletados. Estes podem ser de qualquer tipo como localização, atividade ou um identificador de sessão

source: Timestreams - Replication
pt_br: Timestreams - Replicação

source: You can replicate your data sources from one timestreams blog to another. This is useful if you are collecting data locally and want to provide it publicly as well.
pt_br: Você pode replicar as suas fontes de dados a partir de um blog contendo um timestream para o outro. Isto é conveniente caso você esteja coletando dados localmente e queira provê-los de forma pública simultaneamente.

source: Timestreams supports two types of replication -- discrete and continuous. Discrete replication means doing a single data transfer. Continuous means that your data will be tranfered all the time as new data come in from a data source.
pt_br: Os timestreams funcionam com dois tipos de replicação - discreto e contínuo. Replicação discreta significa que uma única transferência de daos. Contínua significa que seus dados serão transferidos sempre que um novo dados aparecer nas fontes de dados.

source: To use replication complete the form below and click add replication record.
pt_br: Para utilizar a replicação complete o formulário abaixo e clique em adicionar registro de replicação.

source: Timestreams - Visualisations
pt_br: Timestreams - Visualizações

source: Here is a list and descriptions of the different timestreams visualisations that have been designed by Horizon and Active Ingredient for you to embed in your post or webpage.
pt_br: Aqui está uma lista e descrições das diferentes visualizações de timestream desenvolvidos pelo Horizon e pela Active Ingredient para você colocar no seus posts ou páginas

source: Timestream Pages
pt_br: Páginas de Timestream

source: Timestream Page
pt_br: Páginas de Timestream

source: Add A New Timestream Page
pt_br: Adicionar uma nova Página de Timestream

source: Edit Timestream Pages
pt_br: Editar páginas de Timestream

source: New Timestream Page
pt_br: Adicionar uma nova Página de Timestream

source: View This Timestream Page
pt_br: Visualizar a página deste Timestream

source: Search Timestream Page
pt_br: Procurar por uma Página de Timestream

source: Local Table
pt_br: Tabela Local

source: Remote-User Login Name
pt_br: Nome do usuário remoto

source: Remote-User Password
pt_br: Senha do usuário remoto

source: Remote Url
pt_br: URL remota

source: Remote Table
pt_br: Tabela remota

source: Continuous
pt_br: Contínua

source: Add Replication Record
pt_br: Adicionar Registro de Replicação

source: Record added.
pt_br: Registro adicionado

source: Add New Data Source
pt_br: Adicionar fonte de dados

source: What are you measuring
pt_br: O que você está medindo?

source: What is the minimum value of measurement you expect to be recorded?
pt_br: Qual o valor mínimo de medida que você espera ser gravado?

source: What is the maximum value of measurement you expect to be recorded?
pt_br: Qual o valor máximo de medida que você espera ser gravado?

source: What is the symbol of this measurement (e,g, C)?
pt_br: Qual o simbolo desta medida(por exemplo, C)?

source: What is the unique name of device containing your sensor called (e.g. Rachel's Eco Sense)?
pt_br: Qual o nome único do dispositivo contendo o sensor utilizado (por exemplo "Eco Sense da Rachel")?

source: Any Other Information (this is to help you recognise the data source):
pt_br: Alguma informação adicional (isto é para ajudar no reconhecimento da fonte de dados)

source: What value does your device use if it has an error or a missing value?
pt_br: Qual o valor a ser utilizado pelo dispositivo ser um erro ou um valor inexistente estiver presente?

source: Create a new Timestream
pt_br: Criar um novo Timestream

source: Timestream Name
pt_br: Nome do Timestream

source: Data Source
pt_br: Fonte de Dados

source: Create Timestream
pt_br: Criar Timestream

source: Add Context Record
pt_br: Adicionar registro de contexto

source: To add a context record complete the form and click add context record. Please note that start and end times are optional. If they are left blank then the context is considered to apply to the earliest or latest readings.
pt_br: Para adicionar um registro de contexto complete o formulário e clique em adicionar registro de contexto. Por favor observe que tempos iniciais e finais são opcionais. Se os mesmos forem deixados em branco, então o contexto será aplicado à primeira e à última leitura de dados.

source: Context Type
pt_br: Tipo de contexto

source: Value
pt_br: Valor

source: Start Time
pt_br: Tempo Inicial

source: End Time
pt_br: Tempo Final

source: Displaying
pt_br: Visualizando

source: of
pt_br: de

source: local table
pt_br: tabela local

source: remote user
pt_br: usuário remoto

source: remote url
pt_br: URL remota

source: remote table
pt_br: tabela remota

source: continuous
pt_br: contínua

source: last replication
pt_br: última replicação

source: Replicate Now
pt_br: Replicar agora

source: last_replication
pt_br: última replicação

source: Displaying
pt_br: Visualizando

source: Hide Description
pt_br: Esconder descrição

source: Show Description
pt_br: Mostar descrição

source: Welcome to the Timestreams Wordpress plugin from the <a href="http://horizab1.miniserver.com/relate/" title="Relate Project website">Relate project</a>. Timestreams is developed in collaboration between <a href="http://www.horizon.ac.uk" title="Horizon website">Horizon Digital Economy Research Institute</a> of the University of Nottingham, <a href="http://www.i-am-ai.net" title="Active Ingredient website">Active Ingredient</a>, The Met Office Hadley Centre, Brazilian curator Silvia Leal, University of Exeter, and a number of communities in Brazil and the UK. The project is funded by <a href="http://www.rcuk.ac.uk/" title="RCUK website">RCUK</a>.
pt_br: Boas vindas ao plugin Timestreams Wordpress da <a href="http://horizab1.miniserver.com/relate/" title="Relate Project website">Relate Project</a>. O timestreams é desenvolvido em colaboração entre o <a href="http://www.horizon.ac.uk" title="Horizon website">Horizon Digital Economy Research Institute</a> da Universidade de Nottingham, <a href="http://www.i-am-ai.net" title="Active Ingredient website">Active Ingredient</a>, The Met Office Hadley Centre, curadoria brasileira por Silvia Leal, Universidade de Exeter,e um número de comunidades tanto no Brasil quanto no Reino Unido. Este projeto é financiado pelo <a href="http://www.rcuk.ac.uk/" title="RCUK website">RCUK</a>

source: Timestreams is an online platform built in Wordpress for capturing, interpreting and visualising time series data. The platform has been developed for artists to capture and conceptualise environmental data, to look at the relationship between climate change and energy. Timestreams will be released after this research phase to the public, designed for artists, developers, hackers, amateur scientists, schools and communities to set up their own Timestream projects.
pt_br: O timestream é uma plataforma online contruída no Wordpress para capturar, interpretar e visualizar dados na linha do tempo. A plataforma tem sido desenvolvida por artistar para capturar e conceitualizar dados ambientais, para observar o relacionamento entre mudanças climáticas e energia. O timestream vai ser lançado para o público após este fase de pesquisa, o qual é desenvolido para artistas, desenvolvedores, hackers, cientistas amadores, escolar e comunidades que queiram configurar os seus projetos de timstream.

source: Once you have set up your timestreams you can choose to output the data as a blog post or a separate webpage, there is also a library of visualisations that are available to embed in your post or webpage. <a href="https://github.com/pszjmb1/Timestreams/wiki/Timestreams-API-Documentation" title="Timestreams api">Click here</a> to learn how to send Timestreams data to a non-web based visualisation or Arduino using the API.
pt_br: Uma vez configurado o seu timestream, você pode selecionar a saída de dados como um post de um blog ou como uma página separada. Há também uma biblioteca de visualizações que está disponível para agregar no seu post ou em sua página. <a href="https://github.com/pszjmb1/Timestreams/wiki/Timestreams-API-Documentation" title="Timestreams api"> Clique aqui </a> para aprender como enviar dados dos timestreams para uma visualização não baseada na internet ou o Arduino utlizando a API.

source: Timestreams can be used with existing data (basic technical skills) on the site and with new data you collect yourself (moderate technical skills). You can collect data manually using our upload app or Timesense tool kit. Go to <a href="http://192.168.56.101/wordpress/wp-admin/admin.php?page=timestreams/admin/interface.phpdatasources" title="datasources">the datasources page</a> for more information on collecting your own data.
pt_br: Timestreams podem ser utlizados com dados existentes (conhecimentos técnicos básicos) na página e com novos dados coletados por você(conhecimentos técnicos moderados)

source: To create a Timestream:
pt_br: Para criar um Timestream:

source: Type in a name for your timestream
pt_br: Digite um nome para o seu Timestream

source: Choose the data source that you would like to include in your post, page or output application.
pt_br: Selecione a fonte de dados que você quer incluir no seu "post", página ou aplicativo de saída

source: Choose the range of data that you would like to appear in your post, blog or by used by the API.
pt_br: Selecione o intervalo de dados que você quer que apareça no seu "post", blog ou para ser utilizado pela API.

source: You can set up as many timestreams as you want to output to your post, webpage or API.
pt_br: Você pode configurar quantos timestreams você quiser para aparecer no seu "post", página ou API.

source: Once you have set up your timestream the data will appear on a timeline below as a graph with an x and y axis. The way it is displayed depends on what type of data it is:
pt_br: Uma vez configurado o seu timestream, os dados aparecerão em um fluxo do tempo, conforme o gráfico com eixos X e Y mostrado abaixo. A maneira como são mostrados depende de que tipo os dados são:

source: Numerical data will appear as a bar graph with the units of measurement on the x axis and the measurement of the data on the y axis.
pt_br: Dados numéricos irão aparecer como um gráfico de barras com as unidades de medida no eixo x e as medidas dos dados no eixo y.

source: Media and text files will appear as a timeline of the items that you can scroll through.
pt_br: Mídia e arquivos de texto serão mostrados em uma linha de tempo com os itens que você poderá fazer uma rolagem sobre os mesmos.

source: Use the scroll bar below the timeline to zoom in and out and move along the timeline.
pt_br: Use a barra de rolagem abaixo da linha do tempo para aumetar e diminuir o zoom, e mover pela linha do tempo.

source: You can change timestream being shown by selecting an alternate datasource from the dropdown box above the timestream, and then clicking the update button.
pt_br: Você pode mudar o timestream a ser exibido selecionando uma fonte de dados alternativa na caixa de opções acima do timestream, e em seguida clicando no botão atualizar.

source: Delete a timestream by clickign its delete button. Please note that this does not delete the datasource.
pt_br: Delete um timestream clicando no botão deletar. Observe que a sua fonte de dados não é deletada.

source: To author data
pt_br: Para criar dados

source: You can author your data using your timestream.
pt_br: Você pode criar os seus dados usando o seu timestream.

source: Click start
pt_br: Clique em começar

source: Click on the timeline where you want the data in your timestream to begin.
pt_br: Clique na linha do tempo onde você quer que os dados do timestream começem.

source: Click end.
pt_br: Clique em finalizar.

source: Click on the timeline where you want the data in your timestream to end. A green overlay should appear over the data range that you have chosen.
pt_br: Clique na linha do tempo onde você quer que os dados do timestream acabem.

source: Click head and then click the area in the timestream to begin playing from.
pt_br: Clique em principal ("head") e em seguida clique na área do timestream para começar a reproduzir os dados.

source: Set the speed that the data plays out using the rate field (1=realtime, 2=double time, 0.5= half time, etc..)
pt_br: Mude a velocidade com a qual os dados são reproduzidos utilizando a opção taxa (1= em tempo real, 2= no dobro do tempo, 0.5 = na metade do tempo, etc...).

source: Click save
pt_br: Clique em salvar

source: Note that if your toggle on the "start / end time disabled:" checkbox then the timesream will continue to play data as new values come in. If this is toggled off and there is an endtime set, the the data will loop to the start once the end is reached.
pt_br: Observe que se você selecionar o "tempo inicial / final como desabilitado", então o seu timestream vai continuar a reproduzir quando novos dados aparecerem. Se esta opção estiver desligada e um tempo final foi previamente configurado, os dados vão começar novamente do princípio quando o final for atingido.

source: After you have authored your timestreams you can put them in blog posts, blog pages, or special timestreams pages.
pt_br: Após criar os seus timestreams você pode colocá-los nos seus "posts", páginas de blog, ou páginas especiais de Timestreams.

source: update
pt_br: atualizar

source: delete
pt_br: deletar

source: new head time
pt_br: novo tempo principal

source: new start time
pt_br: novo tempo inicial

source: new end time
pt_br: novo tempo final

source: start / end time disabled
pt_br: tempo inicial / final desabilitado

source: rate
pt_br: taxa

source: start
pt_br: começar

source: end
pt_br: finalizar

source: head
pt_br: principal

source: prev
pt_br: anterior

source: next
pt_br: próximo

source: latest
pt_br: ultimo

source: save
pt_br: salvar

source: Context Table
pt_br: Tabela Contexto
